//
//  Cell.h
//  DNA2
//
//  Created by Evgeny Pozdnyakov on 04.11.12.
//  Copyright (c) 2012 __MyCompanyName__. All rights reserved.
//

#import <Foundation/Foundation.h>

// константа класса, хранит имена возможных нуклеотидов
static const char nucleotides[] = "GATC";

// константа класса, хранит количество нуклеотидов в цепи ДНК
static const int nucleotidesInDna = 100;

@interface Cell : NSObject {
    // переменная объекта, хранит цепь нуклеотидов
    // в виде объектов NSString
    NSMutableArray * DNA;
}

// статический метод для получения случайного нуклеотида
+ (NSString *) getRandomNucleotide;

// переопределенный метод инициализации
// нужен для создания нового объекта
// с произвольной цепью нуклеотидов
- (Cell *) init;

// генерацию произвольной цепи нуклеотидов вынесем в отдельный метод
// данный метод нам будет нужен только при инициализации объекта,
// поэтому он должен вызываться для одного объекта только один раз
- (void) fillDnaOnce;

// также нам пригодится метод, выводящий цепь нуклеотидов на экран
- (void) printDna;

// данный метод сравнивает цепь нукеотидов в текущем объекте
// с цепью в переданном объекте
// и возвращает количество расхождений
- (int) hammingDistance:(Cell *)cellToCompare;

@end
