//
//  Cell+Evolution.m
//  03_dna
//
//  Created by Stas on 11/9/12.
//  Copyright (c) 2012 Stas. All rights reserved.
//

#import "Cell+Evolution.h"

@implementation Cell (Evolution)                        // категория Cell (Evolution)

-(void) mutate: (int) percent {
    if (percent <= 0 || percent > 100)                  // выходим,
        return;                                         // если неправильный процент
    if (LENGTH_ARRAY != 100)                            // пересчитываем процент,
        percent = percent * LENGTH_ARRAY / 100;         // если размер масстива не равен 100
    
    // создание массива размером исходного (NSMutableArray * dna) из элементов BOOL, где столько значений YES, сколько процентов нужно изменить.
    BOOL mas [LENGTH_ARRAY];                            // создаем массив из логических эл-тов размером исходного массива
    int count = LENGTH_ARRAY;                           // вводим переменную-счетчик count, инициализировав ее размером массива
    while (count--)                                     // цикл перебора всех эл-тов массива
        mas [count] = count < percent? YES : NO;        // устанавливаем в YES те эл-ты, которые в позже изменим. остальные в NO

    ///////////////////////////////////////////////////////////////////////////////////
    // перемешиваем массив логических эл-тов Boolean //////////////////////////////////
    count = LENGTH_ARRAY;                   // возвращаем переменной count значения количества эл-тов массива
    int temp_index;                         // вводим переменную-буфер для запоминания индекса изменяемого эл-та
    BOOL temp_value;                                    // вводим переменную-буфер для запоминания значения изменяемого эл-та
    while (count--) {                                   // цикл перебора всех эл-тов массива
        temp_index = arc4random() % LENGTH_ARRAY;       // заполняем переменную-буфер индексом изменяемтого эл-та
        temp_value = mas [temp_index];                  // заполняем переменную-буфер изменяемым эл-том
        mas [temp_index] = mas [count];                 // меняем местами 1
        mas [count] = temp_value;                       // меняем местами 2
    }
    ///////////////////////////////////////////////////////////////////////////////////
    // процесс мутации ////////////////////////////////////////////////////////////////
    count = LENGTH_ARRAY;                               // возвращаем переменной count значения количества эл-тов массива
    NSString * temp;                                    // вводим переменную-буфер для запоминания значения изменяемого эл-та (для проверки изменения)
    while (count--)                                     // цикл перебора всех эл-тов массива
        if (mas[count]) {                               // изменяем только те эл-ты, для которых в mas [count] == YES
            temp = [dna objectAtIndex:count];           // заполняем переменную-буфер изменяемым эл-том
            do [dna replaceObjectAtIndex:count withObject:ch[arc4random()%4]]; // метод изменения значения в массиве *dna
            while ([dna objectAtIndex:count] == temp);    // проверяем изменилось ли значение? повторяем до тех пор, пока не изменится
        }
    ///////////////////////////////////////////////////////////////////////////////////
}
    // метод mutate закончен //////////////////////////////////////////////////////////
@end
